In [40]:
import pandas as pd
import numpy as np

In [65]:
df=pd.read_csv('C:\\Users\\pushk\\Downloads\\Salary_Data.csv')

In [9]:
df.info

<bound method DataFrame.info of     YearsExperience    Salary
0               1.1   39343.0
1               1.3   46205.0
2               1.5   37731.0
3               2.0   43525.0
4               2.2   39891.0
5               2.9   56642.0
6               3.0   60150.0
7               3.2   54445.0
8               3.2   64445.0
9               3.7   57189.0
10              3.9   63218.0
11              4.0   55794.0
12              4.0   56957.0
13              4.1   57081.0
14              4.5   61111.0
15              4.9   67938.0
16              5.1   66029.0
17              5.3   83088.0
18              5.9   81363.0
19              6.0   93940.0
20              6.8   91738.0
21              7.1   98273.0
22              7.9  101302.0
23              8.2  113812.0
24              8.7  109431.0
25              9.0  105582.0
26              9.5  116969.0
27              9.6  112635.0
28             10.3  122391.0
29             10.5  121872.0>

In [10]:
df.shape

<bound method NDFrame.sample of     YearsExperience    Salary
0               1.1   39343.0
1               1.3   46205.0
2               1.5   37731.0
3               2.0   43525.0
4               2.2   39891.0
5               2.9   56642.0
6               3.0   60150.0
7               3.2   54445.0
8               3.2   64445.0
9               3.7   57189.0
10              3.9   63218.0
11              4.0   55794.0
12              4.0   56957.0
13              4.1   57081.0
14              4.5   61111.0
15              4.9   67938.0
16              5.1   66029.0
17              5.3   83088.0
18              5.9   81363.0
19              6.0   93940.0
20              6.8   91738.0
21              7.1   98273.0
22              7.9  101302.0
23              8.2  113812.0
24              8.7  109431.0
25              9.0  105582.0
26              9.5  116969.0
27              9.6  112635.0
28             10.3  122391.0
29             10.5  121872.0>

In [11]:
df.columns

Index(['YearsExperience', 'Salary'], dtype='object')

In [12]:
df.size

60

In [13]:
df.dtypes

YearsExperience    float64
Salary             float64
dtype: object

In [20]:
df.head().T

                       0        1        2        3        4
YearsExperience      1.1      1.3      1.5      2.0      2.2
Salary           39343.0  46205.0  37731.0  43525.0  39891.0

In [19]:
df.tail().T

                       25        26        27        28        29
YearsExperience       9.0       9.5       9.6      10.3      10.5
Salary           105582.0  116969.0  112635.0  122391.0  121872.0

In [18]:
df.sample(5).T

                      8        9        10        24       0
YearsExperience      3.2      3.7      3.9       8.7      1.1
Salary           64445.0  57189.0  63218.0  109431.0  39343.0

In [25]:
df.isna().sum()

YearsExperience    0
Salary             0
dtype: int64

In [30]:
df.columns

Index(['YearsExperience', 'Salary'], dtype='object')

In [31]:
df['Salary']=df['Salary'].fillna(df['Salary'].mode()[0])
df['Salary']

0      39343.0
1      46205.0
2      37731.0
3      43525.0
4      39891.0
5      56642.0
6      60150.0
7      54445.0
8      64445.0
9      57189.0
10     63218.0
11     55794.0
12     56957.0
13     57081.0
14     61111.0
15     67938.0
16     66029.0
17     83088.0
18     81363.0
19     93940.0
20     91738.0
21     98273.0
22    101302.0
23    113812.0
24    109431.0
25    105582.0
26    116969.0
27    112635.0
28    122391.0
29    121872.0
Name: Salary, dtype: float64

In [32]:
df['YearsExperience']=df['YearsExperience'].fillna(df['YearsExperience'].mode()[0])
df['YearsExperience']

0      1.1
1      1.3
2      1.5
3      2.0
4      2.2
5      2.9
6      3.0
7      3.2
8      3.2
9      3.7
10     3.9
11     4.0
12     4.0
13     4.1
14     4.5
15     4.9
16     5.1
17     5.3
18     5.9
19     6.0
20     6.8
21     7.1
22     7.9
23     8.2
24     8.7
25     9.0
26     9.5
27     9.6
28    10.3
29    10.5
Name: YearsExperience, dtype: float64

In [33]:
 df.describe()

       YearsExperience         Salary
count        30.000000      30.000000
mean          5.313333   76003.000000
std           2.837888   27414.429785
min           1.100000   37731.000000
25%           3.200000   56720.750000
50%           4.700000   65237.000000
75%           7.700000  100544.750000
max          10.500000  122391.000000

In [34]:
print(df['YearsExperience'].groupby(df['YearsExperience']).describe())

                 count  mean  std   min   25%   50%   75%   max
YearsExperience
1.1                1.0   1.1  NaN   1.1   1.1   1.1   1.1   1.1
1.3                1.0   1.3  NaN   1.3   1.3   1.3   1.3   1.3
1.5                1.0   1.5  NaN   1.5   1.5   1.5   1.5   1.5
2.0                1.0   2.0  NaN   2.0   2.0   2.0   2.0   2.0
2.2                1.0   2.2  NaN   2.2   2.2   2.2   2.2   2.2
2.9                1.0   2.9  NaN   2.9   2.9   2.9   2.9   2.9
3.0                1.0   3.0  NaN   3.0   3.0   3.0   3.0   3.0
3.2                2.0   3.2  0.0   3.2   3.2   3.2   3.2   3.2
3.7                1.0   3.7  NaN   3.7   3.7   3.7   3.7   3.7
3.9                1.0   3.9  NaN   3.9   3.9   3.9   3.9   3.9
4.0                2.0   4.0  0.0   4.0   4.0   4.0   4.0   4.0
4.1                1.0   4.1  NaN   4.1   4.1   4.1   4.1   4.1
4.5                1.0   4.5  NaN   4.5   4.5   4.5   4.5   4.5
4.9                1.0   4.9  NaN   4.9   4.9   4.9   4.9   4.9
5.1                1.0   5.1  NaN   5.1   5.1   5.1   5.1   5.1
5.3                1.0   5.3  NaN   5.3   5.3   5.3   5.3   5.3
5.9                1.0   5.9  NaN   5.9   5.9   5.9   5.9   5.9
6.0                1.0   6.0  NaN   6.0   6.0   6.0   6.0   6.0
6.8                1.0   6.8  NaN   6.8   6.8   6.8   6.8   6.8
7.1                1.0   7.1  NaN   7.1   7.1   7.1   7.1   7.1
7.9                1.0   7.9  NaN   7.9   7.9   7.9   7.9   7.9
8.2                1.0   8.2  NaN   8.2   8.2   8.2   8.2   8.2
8.7                1.0   8.7  NaN   8.7   8.7   8.7   8.7   8.7
9.0                1.0   9.0  NaN   9.0   9.0   9.0   9.0   9.0
9.5                1.0   9.5  NaN   9.5   9.5   9.5   9.5   9.5
9.6                1.0   9.6  NaN   9.6   9.6   9.6   9.6   9.6
10.3               1.0  10.3  NaN  10.3  10.3  10.3  10.3  10.3
10.5               1.0  10.5  NaN  10.5  10.5  10.5  10.5  10.5

In [66]:
print(df['Salary'].groupby(df['Salary']).describe())

          count      mean  std       min       25%       50%       75%  \
Salary
37731.0     1.0   37731.0  NaN   37731.0   37731.0   37731.0   37731.0
39343.0     1.0   39343.0  NaN   39343.0   39343.0   39343.0   39343.0
39891.0     1.0   39891.0  NaN   39891.0   39891.0   39891.0   39891.0
43525.0     1.0   43525.0  NaN   43525.0   43525.0   43525.0   43525.0
46205.0     1.0   46205.0  NaN   46205.0   46205.0   46205.0   46205.0
54445.0     1.0   54445.0  NaN   54445.0   54445.0   54445.0   54445.0
55794.0     1.0   55794.0  NaN   55794.0   55794.0   55794.0   55794.0
56642.0     1.0   56642.0  NaN   56642.0   56642.0   56642.0   56642.0
56957.0     1.0   56957.0  NaN   56957.0   56957.0   56957.0   56957.0
57081.0     1.0   57081.0  NaN   57081.0   57081.0   57081.0   57081.0
57189.0     1.0   57189.0  NaN   57189.0   57189.0   57189.0   57189.0
60150.0     1.0   60150.0  NaN   60150.0   60150.0   60150.0   60150.0
61111.0     1.0   61111.0  NaN   61111.0   61111.0   61111.0   61111.0
63218.0     1.0   63218.0  NaN   63218.0   63218.0   63218.0   63218.0
64445.0     1.0   64445.0  NaN   64445.0   64445.0   64445.0   64445.0
66029.0     1.0   66029.0  NaN   66029.0   66029.0   66029.0   66029.0
67938.0     1.0   67938.0  NaN   67938.0   67938.0   67938.0   67938.0
81363.0     1.0   81363.0  NaN   81363.0   81363.0   81363.0   81363.0
83088.0     1.0   83088.0  NaN   83088.0   83088.0   83088.0   83088.0
91738.0     1.0   91738.0  NaN   91738.0   91738.0   91738.0   91738.0
93940.0     1.0   93940.0  NaN   93940.0   93940.0   93940.0   93940.0
98273.0     1.0   98273.0  NaN   98273.0   98273.0   98273.0   98273.0
101302.0    1.0  101302.0  NaN  101302.0  101302.0  101302.0  101302.0
105582.0    1.0  105582.0  NaN  105582.0  105582.0  105582.0  105582.0
109431.0    1.0  109431.0  NaN  109431.0  109431.0  109431.0  109431.0
112635.0    1.0  112635.0  NaN  112635.0  112635.0  112635.0  112635.0
113812.0    1.0  113812.0  NaN  113812.0  113812.0  113812.0  113812.0
116969.0    1.0  116969.0  NaN  116969.0  116969.0  116969.0  116969.0
121872.0    1.0  121872.0  NaN  121872.0  121872.0  121872.0  121872.0
122391.0    1.0  122391.0  NaN  122391.0  122391.0  122391.0  122391.0

               max
Salary
37731.0    37731.0
39343.0    39343.0
39891.0    39891.0
43525.0    43525.0
46205.0    46205.0
54445.0    54445.0
55794.0    55794.0
56642.0    56642.0
56957.0    56957.0
57081.0    57081.0
57189.0    57189.0
60150.0    60150.0
61111.0    61111.0
63218.0    63218.0
64445.0    64445.0
66029.0    66029.0
67938.0    67938.0
81363.0    81363.0
83088.0    83088.0
91738.0    91738.0
93940.0    93940.0
98273.0    98273.0
101302.0  101302.0
105582.0  105582.0
109431.0  109431.0
112635.0  112635.0
113812.0  113812.0
116969.0  116969.0
121872.0  121872.0
122391.0  122391.0

In [71]:
df=pd.read_csv('C:\\Users\\pushk\\Downloads\\iris.csv')
df.columns = ['ID', 'SepalLengthCm', 'SepalWidthCm', 'PetalLengthCm', 'PetalWidthCm', 'Species']

In [72]:
df.head().T

                         0            1            2            3            4
ID                       1            2            3            4            5
SepalLengthCm          5.1          4.9          4.7          4.6          5.0
SepalWidthCm           3.5          3.0          3.2          3.1          3.6
PetalLengthCm          1.4          1.4          1.3          1.5          1.4
PetalWidthCm           0.2          0.2          0.2          0.2          0.2
Species        Iris-setosa  Iris-setosa  Iris-setosa  Iris-setosa  Iris-setosa

In [59]:
df['SepalLengthCm'].groupby(df['Species']).describe()

                 count   mean       std  min    25%  50%  75%  max
Species
Iris-setosa       50.0  5.006  0.352490  4.3  4.800  5.0  5.2  5.8
Iris-versicolor   50.0  5.936  0.516171  4.9  5.600  5.9  6.3  7.0
Iris-virginica    50.0  6.588  0.635880  4.9  6.225  6.5  6.9  7.9

In [61]:
df['SepalWidthCm'].groupby(df['Species']).describe()

                 count   mean       std  min    25%  50%    75%  max
Species
Iris-setosa       50.0  3.418  0.381024  2.3  3.125  3.4  3.675  4.4
Iris-versicolor   50.0  2.770  0.313798  2.0  2.525  2.8  3.000  3.4
Iris-virginica    50.0  2.974  0.322497  2.2  2.800  3.0  3.175  3.8

In [62]:
df['PetalLengthCm'].groupby(df['Species']).describe()

                 count   mean       std  min  25%   50%    75%  max
Species
Iris-setosa       50.0  1.464  0.173511  1.0  1.4  1.50  1.575  1.9
Iris-versicolor   50.0  4.260  0.469911  3.0  4.0  4.35  4.600  5.1
Iris-virginica    50.0  5.552  0.551895  4.5  5.1  5.55  5.875  6.9